In [1]:
import pandas as pd
import json 
from sqlalchemy import create_engine

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Navnoorroot" # (or whatever password you chose during mysql installation)
db_name = "IMDB_Movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
engine = create_engine(connection)

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/IMDB_Movies)

In [5]:
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)

In [6]:
basics.duplicated().sum()

0

In [7]:
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama

In [8]:
akas.head(2)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0

In [9]:
ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1947
1  tt0000002            5.8       264

#### Downloading the 2000 and 2001 datasets to create the tmdb_data dataset

In [10]:
Year = 2001
year_2001 = pd.read_json('Data/tmdb_api_results_2001.json')
year_2001.to_csv(f"final_tmdb_data_{Year}.csv.gz", compression="gzip", index=False)

year_2001.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,None,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.326,1170.0,PG-13

In [11]:
Year = 2000
year_2000 = pd.read_json('Data/tmdb_api_results_2000.json')
year_2000.to_csv(f"final_tmdb_data_{Year}.csv.gz", compression="gzip", index=False)

year_2000.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,None,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,

In [12]:
both_years = pd.concat([year_2000,year_2001], ignore_index = True)

In [13]:
tmdb_data = both_years[['imdb_id', 'budget', 'revenue', 'certification']]

tmdb_data

        imdb_id      budget     revenue certification
0             0         NaN         NaN           NaN
1     tt0113026  10000000.0         0.0
2     tt0113092         0.0         0.0
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  12854953.0            PG
...         ...         ...         ...           ...
2512  tt7797670         0.0         0.0           NaN
2513  tt7797790         0.0         0.0           NaN
2514  tt8665056         0.0         0.0
2515  tt8795764         0.0         0.0            NR
2516  tt9071078         0.0         0.0           NaN

[2517 rows x 4 columns]

In [14]:
tmdb_data.dropna(inplace = True)

/var/folders/0l/_7plg1px5251fbm6lrxyvb580000gn/T/ipykernel_1570/2143524241.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tmdb_data.dropna(inplace = True)

In [15]:
tmdb_data.reset_index()

      index    imdb_id      budget     revenue certification
0         1  tt0113026  10000000.0         0.0
1         2  tt0113092         0.0         0.0
2         4  tt0118694    150000.0  12854953.0            PG
3         5  tt0118852         0.0         0.0             R
4         6  tt0119273  15000000.0         0.0             R
...     ...        ...         ...         ...           ...
1656   2499  tt3041064         0.0         0.0            NR
1657   2500  tt3162630         0.0         0.0
1658   2503  tt4165204         0.0         0.0
1659   2514  tt8665056         0.0         0.0
1660   2515  tt8795764         0.0         0.0            NR

[1661 rows x 5 columns]

In [16]:
tmdb_data[2:4]

     imdb_id    budget     revenue certification
4  tt0118694  150000.0  12854953.0            PG
5  tt0118852       0.0         0.0             R

### Normalizing Genres column

#### We are creating two tables:
##### title_genres & genres

In [17]:
# split the genre column into a list by separating using the ','
basics['genres_split'] = basics['genres'].str.split(',')

basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]

In [18]:
# using .explode to get all the unique genres in a new variable
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
84776,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
84776,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
84776,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
84777,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
84777,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [19]:
genres_split = basics['genres'].str.split(",")
## Explode the series using.explode() and take the .unique() entries only.

unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Mystery', 'Musical', 'Action', 'Adventure', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'War', 'Biography',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [20]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [21]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

**Create a genre mapper dictionary to replace string genres with integers**

In [22]:
#making the genre mapper Dictionary
genre_ints = range(len(unique_genres))

#creating a dictionary that zips unique_genres and genre_ints
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [23]:
title_genres

          tconst genres_split
0      tt0035423       Comedy
0      tt0035423      Fantasy
0      tt0035423      Romance
1      tt0062336        Drama
2      tt0069049        Drama
...          ...          ...
84776  tt9916190       Action
84776  tt9916190    Adventure
84776  tt9916190     Thriller
84777  tt9916362        Drama
84777  tt9916362      History

[158417 rows x 2 columns]

In [24]:
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]

In [25]:
## make new integer genre_id and drop string genres
#basics['genre_id'] = basics['genres_split'].map(genre_map)
#basics = basics.drop(columns=['genres_split', 'originalTitle','isAdult','titleType', 'genres'])
#basics

#basics['genre_id'] = title_genres['genres'].map(genre_map)
#basics = basics.drop(columns='genres')

In [26]:
#converting genre map dict into dataframe
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                                'Genre ID': genre_map.values()})

genre_lookup

    Genre_Name  Genre ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

### Saving MySQL tables with tconst as the primary key

In [27]:
basics.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear           int64
endYear           float64
runtimeMinutes      int64
genres             object
genres_split       object
dtype: object

In [28]:
#basics = basics.drop(columns = 'genre_id')

In [37]:
basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'genres','genres_split'], inplace = True)

In [38]:
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0096056,Crime and Punishment,2002,NaN,126
...,...,...,...,...,...
84773,tt9914942,Life Without Sara Amat,2019,NaN,74
84774,tt9915872,The Last White Witch,2019,NaN,97
84775,tt9916170,The Rehearsal,2019,NaN,51
84776,tt9916190,Safeguard,2020,NaN,95
84777,tt9916362,Coven,2020,NaN,92

In [39]:
# getting the max lenght of column tconst
max_length_tconst = basics['tconst'].fillna('').map(len).max()
max_length_tconst

10

In [40]:
from sqlalchemy.types import *

#calculate max len for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

#using a schema dictionary using sql alchemy datatype objects
basics_schema = {
    "tconst": String(key_len + 1),
    "primaryTitle": Text(title_len + 1),
    "startYear": Float(),
    "endYear": Float(),
    "runtimeMinutes": Integer()
}

In [41]:
#save to sql with dtype and index = False
#title_basics is the name of the table
basics.to_sql('2_title_basics', engine, dtype = basics_schema, if_exists = 'replace', index = False)

84778

In [43]:
#adding the primary key i.e. tconst
engine.execute('ALTER TABLE 2_title_basics ADD PRIMARY KEY (`tconst`);')

In [44]:
q = """
SELECT *
FROM title_basics ;
"""

pd.read_sql(q,engine)

Empty DataFrame
Columns: [tconst, titleType, primaryTitle, originalTitle, isAdult, startYear, endYear, runtimeMinutes, genres, genres_split]
Index: []

In [45]:
#title rating
ratings.to_sql('title_ratings', engine, index = False, if_exists = 'replace')

486723

In [46]:
#title_genre
title_genres.to_sql('title_genres', engine, if_exists = 'replace', index = False)

158417

In [47]:
#genres
genre_lookup.to_sql('genre_lookup', engine, if_exists = 'replace', index = False)

26

In [48]:
#tmdb_data
tmdb_data.to_sql('tmdb_data', engine, if_exists = 'replace', index = False)

1661